---
kind: property
id: P:Autodesk.Revit.DB.Architecture.StairsPath.UpText
source: html/6ad9188c-7cec-f3ca-9007-b641c1f0125f.htm
---
# Autodesk.Revit.DB.Architecture.StairsPath.UpText Property

The stairs up text.

## Syntax (C#)
```csharp
public string UpText { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null
- **Autodesk.Revit.Exceptions.InvalidOperationException** - When setting this property: The stairs path doesn't not show up text so the data being set is inapplicable.